questions = []

class Question():
    def __init__(self, text, true, false1, false2, false3):
            self.text = text
            self.true = true
            self.false1 = false1
            self.false2 = false2
            self.false3 = false3
            questions.append(self)

    def show_q(self, lb, rb1, rb2, rb3, rb4):
        lb.setText(self.text)
        rb1.setText(self.true)
        rb2.setText(self.false1)
        rb3.setText(self.false2)
        rb4.setText(self.false3)

Question('В якому році почалась 1 Світова Війна?', '1914', '2001', '1939', '1671')
Question('В якому році була підписана Люблінська унія?', '1569', '1669', '1539', '1671')
Question('Коли відбулась битва під Берестечком?', '1651', '1648', '1660', '1675')
Question('В якому році відбулось прийняття Конституції Пилипа Орлика?', '1710', '1720', '1705', '1730')
Question('Коли було засноване місто Львів?', '1256', '1260', '1285', '1278')
Question('У якому році Богдан Хмельницький став гетьманом?', '1648', '1654', '1645', '1660')
Question('Коли відбулася Полтавська битва?', '1709', '1700', '1715', '1720')
Question('У якому році була створена Українська Центральна Рада?', '1917', '1915', '1919', '1920')
Question('Коли Україна проголосила незалежність?', '1991', '1989', '1993', '1990')
Question('В якому році відбулось возз’єднання Західної України з УРСР?', '1939', '1945', '1941', '1938')
Question('Коли відбулося прийняття Декларації про державний суверенітет України?', '1990', '1988', '1992', '1989')
Question('Коли почалася Друга світова війна?', '1939', '1941', '1938', '1940')
Question('В якому році Київська Русь прийняла християнство?', '988', '950', '980', '1010')
Question('Коли було засновано Київський університет?', '1834', '1840', '1825', '1830')
Question('В якому році відбулась Конотопська битва?', '1659', '1648', '1665', '1670')
Question('Коли було проголошено Українську Народну Республіку?', '1917', '1915', '1918', '1920')
Question('Коли відбулась Жовтнева революція?', '1917', '1918', '1920', '1916')
Question('В якому році було підписано Брестський мирний договір?', '1918', '1920', '1917', '1919')
Question('Коли було проголошено Акт Злуки між УНР і ЗУНР?', '1919', '1917', '1921', '1920')
Question('Коли було засновано Національний університет «Києво-Могилянська академія»?', '1615', '1620', '1600', '1630')
Question('В якому році Богдан Хмельницький уклав Зборівський мирний договір?', '1649', '1651', '1645', '1653')
